In [1]:
import pandas as pd

In [2]:
people = {
    "first":["samma","soni","saniya"],
    "last":["begam","begam","firdous"],
    "email":["sammabegam23@gmail.com","sonibegam23@gmail.com", "saniyafirdous456@gmail.com"]
}

In [3]:
df=pd.DataFrame(people)

In [4]:
df

    first     last                       email
0   samma    begam      sammabegam23@gmail.com
1    soni    begam       sonibegam23@gmail.com
2  saniya  firdous  saniyafirdous456@gmail.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns=['first_name','last_name','email']

In [7]:
df

  first_name last_name                       email
0      samma     begam      sammabegam23@gmail.com
1       soni     begam       sonibegam23@gmail.com
2     saniya   firdous  saniyafirdous456@gmail.com

In [8]:
df.columns=[x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                       EMAIL
0      samma     begam      sammabegam23@gmail.com
1       soni     begam       sonibegam23@gmail.com
2     saniya   firdous  saniyafirdous456@gmail.com

In [9]:
df.columns=df.columns.str.replace('_', ' ')
df

  FIRST NAME LAST NAME                       EMAIL
0      samma     begam      sammabegam23@gmail.com
1       soni     begam       sonibegam23@gmail.com
2     saniya   firdous  saniyafirdous456@gmail.com

In [10]:
df.columns=[x.lower() for x in df.columns]
df

  first name last name                       email
0      samma     begam      sammabegam23@gmail.com
1       soni     begam       sonibegam23@gmail.com
2     saniya   firdous  saniyafirdous456@gmail.com

In [11]:
df.columns=df.columns.str.replace(' ', '_')
df

  first_name last_name                       email
0      samma     begam      sammabegam23@gmail.com
1       soni     begam       sonibegam23@gmail.com
2     saniya   firdous  saniyafirdous456@gmail.com

In [12]:
df.rename(columns={'first_name':'first','last_name':'last'},inplace=True)

In [13]:
df

    first     last                       email
0   samma    begam      sammabegam23@gmail.com
1    soni    begam       sonibegam23@gmail.com
2  saniya  firdous  saniyafirdous456@gmail.com

In [14]:
df.loc[2]

first                        saniya
last                        firdous
email    saniyafirdous456@gmail.com
Name: 2, dtype: object

In [15]:
df.loc[2]=['sageena','khatoon','sageenak34@gmail.com']

In [16]:
df

     first     last                   email
0    samma    begam  sammabegam23@gmail.com
1     soni    begam   sonibegam23@gmail.com
2  sageena  khatoon    sageenak34@gmail.com

In [17]:
df.loc[2,['last','email']]

last                  khatoon
email    sageenak34@gmail.com
Name: 2, dtype: object

In [18]:
df.loc[2,['last','email']]=['firdous','sageenafirdous456@gmail.com']

In [19]:
df

     first     last                        email
0    samma    begam       sammabegam23@gmail.com
1     soni    begam        sonibegam23@gmail.com
2  sageena  firdous  sageenafirdous456@gmail.com

In [20]:
df.loc[2,'last']='khatoon'

In [21]:
df

     first     last                        email
0    samma    begam       sammabegam23@gmail.com
1     soni    begam        sonibegam23@gmail.com
2  sageena  khatoon  sageenafirdous456@gmail.com

In [22]:
df.at[2,'last']='begam'

In [23]:
df

     first   last                        email
0    samma  begam       sammabegam23@gmail.com
1     soni  begam        sonibegam23@gmail.com
2  sageena  begam  sageenafirdous456@gmail.com

In [24]:
filt=(df['email']=='sageenafirdous456@gmail.com')
df[filt]

     first   last                        email
2  sageena  begam  sageenafirdous456@gmail.com

In [25]:
filt=(df['email']=='sageenafirdous456@gmail.com')
df.loc[filt,'last']='raja'

In [26]:
df

     first   last                        email
0    samma  begam       sammabegam23@gmail.com
1     soni  begam        sonibegam23@gmail.com
2  sageena   raja  sageenafirdous456@gmail.com

In [27]:
df['email'].str.lower()

0         sammabegam23@gmail.com
1          sonibegam23@gmail.com
2    sageenafirdous456@gmail.com
Name: email, dtype: object

In [28]:
df['email']=df['email'].str.lower()

In [29]:
df

     first   last                        email
0    samma  begam       sammabegam23@gmail.com
1     soni  begam        sonibegam23@gmail.com
2  sageena   raja  sageenafirdous456@gmail.com

In [30]:
df['email'].apply(len)

0    22
1    21
2    27
Name: email, dtype: int64

In [31]:
def update_email(email):
    return email.upper()

In [32]:
df['email'].apply(update_email)

0         SAMMABEGAM23@GMAIL.COM
1          SONIBEGAM23@GMAIL.COM
2    SAGEENAFIRDOUS456@GMAIL.COM
Name: email, dtype: object

In [33]:
df['email']=df['email'].apply(update_email)

In [34]:
df

     first   last                        email
0    samma  begam       SAMMABEGAM23@GMAIL.COM
1     soni  begam        SONIBEGAM23@GMAIL.COM
2  sageena   raja  SAGEENAFIRDOUS456@GMAIL.COM

In [35]:
df['email']=df['email'].apply(lambda x:x.lower())

In [36]:
df

     first   last                        email
0    samma  begam       sammabegam23@gmail.com
1     soni  begam        sonibegam23@gmail.com
2  sageena   raja  sageenafirdous456@gmail.com

In [37]:
df['email'].apply(len)

0    22
1    21
2    27
Name: email, dtype: int64

In [38]:
df.apply(len,axis='columns')

0    3
1    3
2    3
dtype: int64

In [39]:
len(df['email'])

3

In [40]:
df.apply(pd.Series.min)

first                        sageena
last                           begam
email    sageenafirdous456@gmail.com
dtype: object

In [41]:
df.apply(lambda x:x.min())

first                        sageena
last                           begam
email    sageenafirdous456@gmail.com
dtype: object

In [42]:
df.applymap(len)

C:\Users\samma\AppData\Local\Temp\ipykernel_10336\1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  email
0      5     5     22
1      4     5     21
2      7     4     27

In [43]:
df.applymap(str.lower)

C:\Users\samma\AppData\Local\Temp\ipykernel_10336\357608748.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower)

     first   last                        email
0    samma  begam       sammabegam23@gmail.com
1     soni  begam        sonibegam23@gmail.com
2  sageena   raja  sageenafirdous456@gmail.com

In [44]:
df['first'].map({'samma':'glden','soni':'saniya'})

0     glden
1    saniya
2       NaN
Name: first, dtype: object

In [45]:
df['first']=df['first'].replace({'samma':'glden','soni':'saniya'})

In [46]:
df

     first   last                        email
0    glden  begam       sammabegam23@gmail.com
1   saniya  begam        sonibegam23@gmail.com
2  sageena   raja  sageenafirdous456@gmail.com